<script lang="ts">
	import { languageTag } from '$lib/paraglide/runtime';
	import WhatIsSvelteEN from '$lib/articles/en/WhatIsSvelte.svx';
	import WhatIsSvelteUK from '$lib/articles/uk/WhatIsSvelte.svx';

	let article = languageTag() === 'en' ? WhatIsSvelteEN : WhatIsSvelteUK;
</script>

<svelte:component this={article} />

<!-- <section class="">
	**Вітаю на моєму блозі!** Якщо ви тут, то, скоріше за все, з однієї з двох причин: 1. Ви хочете
	дізнатися більше про мене. Можливо, ви рекрутер, а можливо, просто цікавитесь моєю роботою. 2. Вас
	цікавить Svelte, і ви хочете дізнатися більше про цей фреймворк. Хоча це насправді компілятор, а
	не фреймворк, але це не важливо в даному випадку. В будь-якому разі, ви знайшли те, що шукали!
	Хочу одразу сказати, що я не є професійним письменником і не володію майстерністю написання
	чудових текстів. Я намагатимусь викладати свої думки якнайчіткіше та зрозуміліше, але якщо ви
	знайдете помилки в тексті — прошу вибачення. Цей сайт буде доступний на двох мовах: українською та
	англійською. Отже, почну з того, що представлю себе. Мене звати Ярослав, і я вже понад 7 років
	займаюся веб-розробкою. Більшу частину цього часу я працював саме в сфері фронтенду, але час від
	часу захоплювався і бекендом. Починав я, як і більшість, з React. Чому саме з нього? Відповідь
	проста — коли я починав, саме на React було найбільше вакансій. Потім я дуже захопився Vue.js
	через його простоту. Але полюбив я саме Svelte. Спитаєте чому? Це той самий JavaScript, але на
	стероїдах. Він не вимагає від вас знати щось, що виходить за межі JavaScript. Якщо ви вже знаєте
	JavaScript і хоча б бачили React чи Vue, ви швидко зрозумієте Svelte. Тепер давайте перейдемо до
	самого Svelte. Що ж таке Svelte? Перш за все, це не бібліотека чи фреймворк. Це компілятор. Це
	означає, що весь код, який ви пишете на Svelte, компілюється в чистий JavaScript. Ви не тягнете за
	собою велику бібліотеку, як у випадку з React чи Vue. Ви просто пишете код, який хочете бачити на
	сторінці. Яку саме проблему вирішує Svelte? Та ту ж саму, що і інші фреймворки — він допомагає
	створювати динамічні інтерфейси. Але при цьому Svelte використовує HTML, CSS та JavaScript, не
	змушуючи вас вивчати нові концепції, як у React чи Vue. Якщо ви дочитали до цього моменту, то,
	мабуть, вам вже цікаво, що ж таке цей Svelte. Перш за все, я рекомендую ознайомитися з чудовою
	документацією від розробників. З новим оновленим сайтом ви зможете швидко освоїти, як працювати з
	Svelte. А вже після цього, в розділі **Статті**, я публікуватиму свої враження від нових
	можливостей, які з’являються в Svelte. Код цього сайту можна побачити на моєму GitHub.
</section> -->
